test/request-response-samples/execFile__add_default_namespace_prefix/request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="urn:FileExecutor">
  <soap:Body>
    <tns:execFileParams>
      <fileName>PSTN</fileName>
      <arguments>abc</arguments>
      <base64EncodedStdIn>dGVzdA==</base64EncodedStdIn>
      <startDetached>true</startDetached>
    </tns:execFileParams>
  </soap:Body>
</soap:Envelope>
