test/request-response-samples/execFile__valid_xml_generated_on_request_with_complex_type_element_form_default_qualified/request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="urn:FileExecutor" xmlns:FileExecutor="urn:FileExecutor"><soap:Body><FileExecutor:execFileParams xmlns:FileExecutor="urn:FileExecutor" xmlns="urn:FileExecutor"><FileExecutor:fileName>PSTN</FileExecutor:fileName><FileExecutor:arguments>0</FileExecutor:arguments><FileExecutor:base64EncodedStdIn>null</FileExecutor:base64EncodedStdIn><FileExecutor:startDetached>true</FileExecutor:startDetached></FileExecutor:execFileParams></soap:Body></soap:Envelope>