test/request-response-samples/execFile__valid_xml_generated_on_request_with_complex_type_element_form_default_unqualified/request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="urn:FileExecutor" xmlns:FileExecutor="urn:FileExecutor"><soap:Body><FileExecutor:execFileParams xmlns:FileExecutor="urn:FileExecutor"><fileName>PSTN</fileName><arguments>0</arguments><base64EncodedStdIn>null</base64EncodedStdIn><startDetached>true</startDetached></FileExecutor:execFileParams></soap:Body></soap:Envelope>